DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/Platform_TS_T40D34M70I1R0/startup/src/sys_init.c
/*==================================================================================================
*   Project              : RTD AUTOSAR 4.9
*   Platform             : CORTEXM
*   Peripheral           :
*   Dependencies         : none
*
*   Autosar Version      : 4.9.0
*   Autosar Revision     : ASR_REL_4_9_REV_0000
*   Autosar Conf.Variant :
*   SW Version           : 7.0.1
*   Build Version        : S32K3_RTD_7_0_1_D2602_ASR_REL_4_9_REV_0000_20260206
*
*   Copyright 2020 - 2026 NXP
*
*   NXP Confidential and Proprietary. This software is owned or controlled by NXP and may only be
*   used strictly in accordance with the applicable license terms. By expressly
*   accepting such terms or by downloading, installing, activating and/or otherwise
*   using the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms. If you do not agree to be
*   bound by the applicable license terms, then you may not retain, install,
*   activate or otherwise use the software.
==================================================================================================*/
/*================================================================================================
*   @file    sys_init.c
*   @version 7.0.1
*
*   @brief   AUTOSAR Platform - RTD auxiliary APIs used for RTD testing
*   @details RTD auxiliary APIs used for RTD testing
*            This file contains sample code only. It is not part of the production code deliverables
*   @addtogroup PLATFORM
*   @{
*
==================================================================================================*/

#ifdef __cplusplus
extern "C"{
#endif

/*==================================================================================================
*                                         INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "sys_init.h"
#include "nvic.h"
#include "Mcal.h"
#if defined(S32K311) || defined(S32K310)
    #include "S32K311_FXOSC.h"
    #include "S32K311_PMC.h"
    #include "S32K311_PLL.h"
    #include "S32K311_MC_CGM.h"
    #include "S32K311_MC_ME.h"
    #include "S32K311_FIRC.h"
    #include "S32K311_CONFIGURATION_GPR.h"
#endif
#ifdef S32K344
    #include "S32K344_FXOSC.h"
    #include "S32K344_PMC.h"
    #include "S32K344_PLL.h"
    #include "S32K344_MC_CGM.h"
    #include "S32K344_MC_ME.h"
    #include "S32K344_FIRC.h"
    #include "S32K344_CONFIGURATION_GPR.h"
#endif
#ifdef S32K342
    #include "S32K342_FXOSC.h"
    #include "S32K342_PMC.h"
    #include "S32K342_PLL.h"
    #include "S32K342_MC_CGM.h"
    #include "S32K342_MC_ME.h"
    #include "S32K342_FIRC.h"
    #include "S32K342_CONFIGURATION_GPR.h"
#endif
#ifdef S32K341
    #include "S32K341_FXOSC.h"
    #include "S32K341_PMC.h"
    #include "S32K341_PLL.h"
    #include "S32K341_MC_CGM.h"
    #include "S32K341_MC_ME.h"
    #include "S32K341_FIRC.h"
    #include "S32K341_CONFIGURATION_GPR.h"
#endif
#ifdef S32K324
    #include "S32K324_FXOSC.h"
    #include "S32K324_PMC.h"
    #include "S32K324_PLL.h"
    #include "S32K324_MC_CGM.h"
    #include "S32K324_MC_ME.h"
    #include "S32K324_FIRC.h"
    #include "S32K324_CONFIGURATION_GPR.h"
#endif
#ifdef S32K314
    #include "S32K314_FXOSC.h"
    #include "S32K314_PMC.h"
    #include "S32K314_PLL.h"
    #include "S32K314_MC_CGM.h"
    #include "S32K314_MC_ME.h"
    #include "S32K314_FIRC.h"
    #include "S32K314_CONFIGURATION_GPR.h"
#endif
#ifdef S32K312
    #include "S32K312_FXOSC.h"
    #include "S32K312_PMC.h"
    #include "S32K312_PLL.h"
    #include "S32K312_MC_CGM.h"
    #include "S32K312_MC_ME.h"
    #include "S32K312_FIRC.h"
    #include "S32K312_CONFIGURATION_GPR.h"
#endif
#ifdef S32K322
    #include "S32K322_FXOSC.h"
    #include "S32K322_PMC.h"
    #include "S32K322_PLL.h"
    #include "S32K322_MC_CGM.h"
    #include "S32K322_MC_ME.h"
    #include "S32K322_FIRC.h"
    #include "S32K322_CONFIGURATION_GPR.h"
#endif
#if defined(S32K396) || defined(S32K394)
    #include "S32K39_FXOSC.h"
    #include "S32K39_PMC.h"
    #include "S32K39_PLL.h"
    #include "S32K39_MC_CGM.h"
    #include "S32K39_MC_ME.h"
    #include "S32K39_FIRC.h"
    #include "S32K39_CONFIGURATION_GPR.h"
#endif
#if defined(S32K364) || defined(S32K366)
    #include "S32K36_FXOSC.h"
    #include "S32K36_PMC.h"
    #include "S32K36_PLL.h"
    #include "S32K36_MC_CGM.h"
    #include "S32K36_MC_ME.h"
    #include "S32K36_FIRC.h"
    #include "S32K36_CONFIGURATION_GPR.h"
#endif
#if defined(S32K374) || defined(S32K376)
    #include "S32K37_FXOSC.h"
    #include "S32K37_PMC.h"
    #include "S32K37_PLL.h"
    #include "S32K37_MC_CGM.h"
    #include "S32K37_MC_ME.h"
    #include "S32K37_FIRC.h"
    #include "S32K37_CONFIGURATION_GPR.h"
#endif
#if defined(S32K328) || defined(S32K338) || defined(S32K348) || defined(S32K358)
    #include "S32K358_FXOSC.h"
    #include "S32K358_PMC.h"
    #include "S32K358_PLL.h"
    #include "S32K358_MC_CGM.h"
    #include "S32K358_MC_ME.h"
    #include "S32K358_FIRC.h"
    #include "S32K358_CONFIGURATION_GPR.h"
#endif
#ifdef S32K356
    #include "S32K356_FXOSC.h"
    #include "S32K356_PMC.h"
    #include "S32K356_PLL.h"
    #include "S32K356_MC_CGM.h"
    #include "S32K356_MC_ME.h"
    #include "S32K356_FIRC.h"
    #include "S32K356_CONFIGURATION_GPR.h"
#endif
#ifdef S32K388
    #include "S32K388_FXOSC.h"
    #include "S32K388_PMC.h"
    #include "S32K388_PLL.h"
    #include "S32K388_MC_CGM.h"
    #include "S32K388_MC_ME.h"
    #include "S32K388_FIRC.h"
    #include "S32K388_CONFIGURATION_GPR.h"
#endif
#ifdef S32K389
    #include "S32K389_FXOSC.h"
    #include "S32K389_PMC.h"
    #include "S32K389_PLL.h"
    #include "S32K389_MC_CGM.h"
    #include "S32K389_MC_ME.h"
    #include "S32K389_FIRC.h"
    #include "S32K389_CONFIGURATION_GPR.h"
#endif
#if defined(S32M276) || defined(S32M274)
    #include "S32M27x_FXOSC.h"
    #include "S32M27x_PMC.h"
    #include "S32M27x_PLL.h"
    #include "S32M27x_MC_CGM.h"
    #include "S32M27x_MC_ME.h"
    #include "S32M27x_FIRC.h"
    #include "S32M27x_CONFIGURATION_GPR.h"
#endif

/*==================================================================================================
*                                        LOCAL MACROS
==================================================================================================*/
/*Partition 0 */
#if defined(S32K312)
    #define PRTN0_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x000133CFU)
#elif defined(S32K342) || defined(S32K341)
    #define PRTN0_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x000133CFU)
#elif defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    #define PRTN0_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0x001FFFF8U)
    #define PRTN0_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x0003FFC7U)
#elif defined(S32K328) || defined(S32K338) || defined(S32K348) || defined(S32K358) || defined(S32K356)
    #define PRTN0_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0x00000008U)
    #define PRTN0_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x0000F7DFU)
#elif defined(S32K388) || defined(S32K389)
    #define PRTN0_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0x1000000CU)
    #define PRTN0_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x001EF7DFU)
#elif defined(S32K311) || defined(S32K310)
    #define PRTN0_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x000033CFU)
#elif defined(S32M276) || defined(S32M274)
    #define PRTN0_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x400033CFU)
#else
    #define PRTN0_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x0000F7DFU)
#endif
/*Partition 1*/
#if defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    #define PRTN1_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0xFFBFFFFFU)
    #define PRTN1_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0xFDF4AFFFU)
    #define PRTN1_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0xB3F03E7EU)
    #define PRTN1_COFB3_CLKEN_REQ_MASK_U32      ((uint32)0x00005FEFU)
#elif defined(S32K328) || defined(S32K338) || defined(S32K348) || defined(S32K358) || defined(S32K356)
    #define PRTN1_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0xFFBFFFFFU)
    #define PRTN1_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0xFFFEAFFFU)
    #define PRTN1_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0xBBF3FFFEU)
    #define PRTN1_COFB3_CLKEN_REQ_MASK_U32      ((uint32)0x00005FEFU)
#elif defined(S32K342) || defined(S32K341)
    #define PRTN1_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0xF1C0FFF8U)
    #define PRTN1_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x812AA407U)
    #define PRTN1_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0xBBF03E1EU)
    #define PRTN1_COFB3_CLKEN_REQ_MASK_U32      ((uint32)0x00000001U)
#elif defined(S32K388) || defined(S32K389)
    #define PRTN1_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0xFFBFFFFFU)
    #define PRTN1_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0xFFFEAFFFU)
    #define PRTN1_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0xBBFFFFFFU)
    #define PRTN1_COFB3_CLKEN_REQ_MASK_U32      ((uint32)0xFFFF5FEFU)
#elif defined(S32K311) || defined(S32K310)
    #define PRTN1_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0xFFFFFFFAU)
    #define PRTN1_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x1DF6ACFFU)
    #define PRTN1_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0x93F03E0EU)
    #define PRTN1_COFB3_CLKEN_REQ_MASK_U32      ((uint32)0x000001BBU)
#elif defined(S32M276) || defined(S32M274)
    #define PRTN1_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0xFFFFFFFAU)
    #define PRTN1_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x1DF6ACFFU)
    #define PRTN1_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0x93E03E0EU)
    #define PRTN1_COFB3_CLKEN_REQ_MASK_U32      ((uint32)0x00000FFFU)
#elif defined(S32K312)
    #define PRTN1_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0xF1C0FFF8U)
    #define PRTN1_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x1DFEACFFU)
    #define PRTN1_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0xB3F3FE7EU)
    #define PRTN1_COFB3_CLKEN_REQ_MASK_U32      ((uint32)0x00000001U)
#else
    #define PRTN1_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0xF1C0FFF8U)
    #define PRTN1_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0x812AA407U)
    #define PRTN1_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0xBBF3FE7EU)
    #define PRTN1_COFB3_CLKEN_REQ_MASK_U32      ((uint32)0x00000001U)
#endif
/*Partition 2*/

#if defined(S32K342) || defined(S32K341)
    #define PRTN2_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0x29FFFFF0U)
    #define PRTN2_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0xC8880001U)
#elif defined(S32K328) || defined(S32K338) || defined(S32K348) || defined(S32K358) || defined(S32K356)
    #define PRTN2_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0x7FFFFFF7U)
    #define PRTN2_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0xCE8987FAU)
    #define PRTN2_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0x00000039U)
#elif defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    #define PRTN2_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0x7BFFFFF3U)
    #define PRTN2_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0xF8098001U)
    #define PRTN2_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0x00000FFFU)
#elif defined(S32K388) || defined(S32K389)
    #define PRTN2_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0xFFFFFFFFU)
    #define PRTN2_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0xCC8987FEU)
    #if defined(S32K388)
        #define PRTN2_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0x0FFFFF7BU)
    #else   /* S32K389 */
        #define PRTN2_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0xFFFFFF7BU)
    #endif
#else
    #define PRTN2_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0x29FFFFF0U)
    #define PRTN2_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0xCC8987F9U)
#endif

/*Partition 3*/
#if defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    #define PRTN3_COFB0_CLKEN_REQ_MASK_U32      ((uint32)0x6000FFFFU)
    #define PRTN3_COFB1_CLKEN_REQ_MASK_U32      ((uint32)0xEFFFD33DU)
    #define PRTN3_COFB2_CLKEN_REQ_MASK_U32      ((uint32)0x00000003U)
#endif

/*==================================================================================================
*                                      FILE VERSION CHECKS
==================================================================================================*/

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                       GLOBAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                       GLOBAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/

#define PLATFORM_START_SEC_CODE
#include "Platform_MemMap.h"

