DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/Platform_TS_T40D34M70I1R0/startup/src/sys_init.c
static int Init_FIRC(void);
static int Init_FXOSC(void);
static int Init_PMC(void);
static int Init_PLL(void);
static int Init_MC_CGM(void);
static int Switch_Core_FIRC(void);
static int Init_MC_ME(void);

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/

/**
* @brief sys_enableAllInterrupts
* @details function used to enable all interrupts
*/
/*================================================================================================*/
void sys_enableAllInterrupts(void)
{
    OsIf_ResumeAllInterrupts();
}
/*================================================================================================*/
/**
* @brief sys_disableAllInterrupts
* @details function used to disable all interrupts
*/
/*================================================================================================*/
void sys_disableAllInterrupts(void)
{
    OsIf_SuspendAllInterrupts();
}
/*================================================================================================*/
/**
* @brief sys_disableIsrSource
* @details function used to disable the interrupt number id
*/
/*================================================================================================*/
void sys_disableIsrSource(uint8 id)
{
    NVIC_DisableIRQ(id);
}
/*================================================================================================*/
/**
* @brief sys_init
* @details function used to enable the interrupt number id and set up the priority
*/
/*================================================================================================*/
void sys_enableIsrSource(uint8 id, uint8 prio)
{
    NVIC_SetPriority(id, prio);
    NVIC_EnableIRQ(id);
}
/*================================================================================================*/
/**
* @brief sys_init
* @details function used to register the interrupt handler in the interrupt vector
*/
/*================================================================================================*/
void sys_registerIsrHandler(uint8 irq_id, int_function_t isr_handler)
{
    OsIf_SuspendAllInterrupts();
    *(volatile uint32*)((*(volatile uint32*)(0xE000ED08)) + ((16 + irq_id) << 2)) = (uint32)isr_handler;
    OsIf_ResumeAllInterrupts();
}

/*================================================================================================*/
/*
 * system initialization : system clock, interrupt router ...
 */

/*-----------------------------------------------------------------------*/
/* Initialize & Start FIRC = 48MHz                                       */
/*-----------------------------------------------------------------------*/
static int Init_FIRC(void)
{
    volatile uint32 timeout = 0xFFFF;
    volatile int result = 0;
#if !defined(S32K396) && !defined(S32M276) && !defined(S32K394) && !defined(S32M274) && !defined(S32K376) && !defined(S32K374) && !defined(S32K364) && !defined(S32K366)
    /* Header bug: CONFIG_REG_GPR is actually RW. We'll manually cast-away the const */
    volatile uint32 *io_config_reg_gpr = (volatile uint32*) &IP_CONFIGURATION_GPR->CONFIG_REG_GPR;

    /* Check if application cores have access to FIRC_DIV_SEL */
    if (((IP_CONFIGURATION_GPR->CONFIG_REG_GPR & CONFIGURATION_GPR_CONFIG_REG_GPR_APP_CORE_ACC_MASK) >> CONFIGURATION_GPR_CONFIG_REG_GPR_APP_CORE_ACC_SHIFT) == 5)
    {
        *io_config_reg_gpr = CONFIGURATION_GPR_CONFIG_REG_GPR_APP_CORE_ACC(0x5) | CONFIGURATION_GPR_CONFIG_REG_GPR_FIRC_DIV_SEL(3);
        /* firc_clk_freq = 48000000; */
    }
    else
    {
        /* switch (((IP_CONFIGURATION_GPR->CONFIG_REG_GPR & CONFIGURATION_GPR_CONFIG_REG_GPR_FIRC_DIV_SEL_MASK) >> CONFIGURATION_GPR_CONFIG_REG_GPR_FIRC_DIV_SEL_SHIFT))
        {
            case 0:
            case 1:  { firc_clk_freq = 24000000U;   break; }
            case 2:  { firc_clk_freq = 3000000U;    break; }
            case 3:  { firc_clk_freq = 48000000U;   break; }
            default: { firc_clk_freq = 0xFFFFFFFFU; break; }
        } */
    }
#endif

    while ((((IP_FIRC->STATUS_REGISTER & FIRC_STATUS_REGISTER_STATUS_MASK) >> FIRC_STATUS_REGISTER_STATUS_SHIFT) != 1) && (timeout--)) {}
    if (timeout == 0)
    {
        result = 1; /* FIRC_TIMEOUT */
    }
    else
    {
    }

    return result;
}

/*-----------------------------------------------------------------------*/
/* Initialize & Start FXOSC = 16MHz (CVB-257BGA DC)                      */
/*-----------------------------------------------------------------------*/
static int Init_FXOSC(void)
{
    volatile uint32 timeout = 0xFFFF;
    volatile int result = 0;

    /* Set "Crystal Mode" */
    IP_FXOSC->CTRL &= ~FXOSC_CTRL_EOCV_MASK;
    IP_FXOSC->CTRL |= FXOSC_CTRL_EOCV(0x9D);
    IP_FXOSC->CTRL &= ~FXOSC_CTRL_GM_SEL_MASK;
    IP_FXOSC->CTRL |= FXOSC_CTRL_GM_SEL(0xC);
    IP_FXOSC->CTRL &= ~FXOSC_CTRL_OSC_BYP_MASK;
    IP_FXOSC->CTRL |= FXOSC_CTRL_OSC_BYP(0);
    IP_FXOSC->CTRL &= ~FXOSC_CTRL_COMP_EN_MASK;
    IP_FXOSC->CTRL |= FXOSC_CTRL_COMP_EN(1);
    IP_FXOSC->CTRL &= ~FXOSC_CTRL_OSCON_MASK;
    IP_FXOSC->CTRL |= FXOSC_CTRL_OSCON(1);
    while ((((IP_FXOSC->STAT & FXOSC_STAT_OSC_STAT_MASK) >> FXOSC_STAT_OSC_STAT_SHIFT) != 1) && (timeout--)) {}
    if(timeout == 0)
    {
        result = 1;/* FXOSC_TIMEOUT */
    }
    else
    {

    }

    return result; /*Success*/
}

/*-----------------------------------------------------------------------*/
/* Initialize PMC (CVB-257BGA DC)                                        */
/*-----------------------------------------------------------------------*/
static int Init_PMC(void)
{
    volatile uint32 timeout = 0xFFFF;
    volatile int result = 0;

    /* Clear LVSC flags after the initial power ramp-up */
    IP_PMC->LVSC = 0xFFFFFFFFU;

#if defined(S32K388) || defined(S32K389)
        /* Disable SMPS regulator */
        IP_PMC->CONFIG &= ~PMC_CONFIG_LMSMPSEN_MASK;
#endif
    /* Check if Last Mile Regulator is available */
    if ( ((IP_PMC->VERID & PMC_VERID_LMFEAT_MASK) >> PMC_VERID_LMFEAT_SHIFT) == 1)
    {
#if !defined(S32K388) && !defined(S32K389) && !defined(S32K396) && !defined(S32K394) && !defined(S32K376) && !defined(S32K374) && !defined(S32K364) && !defined(S32K366)
        /* Set slow recovery from LPM to avoid high-current demand */
        IP_PMC->CONFIG &= ~PMC_CONFIG_FASTREC_MASK;
        IP_PMC->CONFIG |= PMC_CONFIG_FASTREC(0);
#endif
        /* External BJT between VDD_HD_A and V15 on PCB => Enable Last Mile Regulator Base Control */
#if !defined(S32K311) && !defined(S32K312) && !defined(S32K396) && !defined(S32K358) && !defined(S32K388) && !defined(S32K389) \
    && !defined(S32K328) && !defined(S32K338) && !defined(S32K348)  && !defined(S32K356) && !defined(S32M276) && !defined(S32K394) \
    && !defined(S32K310) && !defined(S32M274) && !defined(S32K376) && !defined(S32K374) && !defined(S32K364) && !defined(S32K366)
        IP_PMC->CONFIG &= ~PMC_CONFIG_LMBCTLEN_MASK;
        IP_PMC->CONFIG |= PMC_CONFIG_LMBCTLEN(1);
#endif

        /* Wait for soft start time of the V15 regulator (>50us) */
        while (timeout--) {}
        timeout = 0xFFFF;

#if !defined(S32K311) && !defined(S32K312) && !defined(S32K396) && !defined(S32K358) && !defined(S32K356) && !defined(S32K388) && !defined(S32K389) \
    && !defined(S32K328) && !defined(S32K338) && !defined(S32K348) && !defined(S32K356) && !defined(S32M276) && !defined(S32K394) \
    && !defined(S32K310) && !defined(S32M274) && !defined(S32K376) && !defined(S32K374) && !defined(S32K364) && !defined(S32K366)
        /* Start polling the status of the V15 regulator */
        while ((((IP_PMC->LVSC & PMC_LVSC_LVD15S_MASK) >> PMC_LVSC_LVD15S_SHIFT) != 0) && (timeout--)) {}
        if (timeout > 0)
        {
            timeout = 0xFFFF;
            /* Set automatic Last Mile turn-over */
            IP_PMC->CONFIG &= ~PMC_CONFIG_LMAUTOEN_MASK;
            IP_PMC->CONFIG |= PMC_CONFIG_LMAUTOEN(1);

            /* Wait for the PMC to switch from Boot Regulator to Last Mile regulator */
            while ((((IP_PMC->CONFIG & PMC_CONFIG_LMSTAT_MASK) >> PMC_CONFIG_LMSTAT_SHIFT) != 1) && (timeout--)) {}
            if (timeout == 0)
            {
                result = 1;/* LMSTAT_TIMEOUT */
            }
            else
            {

