DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/Platform_TS_T40D34M70I1R0/startup/src/sys_init.c
            }
        }
        else
        {
            result = 1;/* LVDV15S_TIMEOUT */
        }

#endif
    }

    return result;
}

/*-----------------------------------------------------------------------*/
/* Initialize PLL                                                        */
/* FXOSC = 16MHz, VCO = 480MHz, PHI0 = 160MHz, PHI1 = 240MHz             */
/* lcm(160, 240) = 2^5 * 3 * 5 = 480 => VCO = 480MHz                     */
/*-----------------------------------------------------------------------*/
static int Init_PLL(void)
{
    volatile uint32 timeout = 0xFFFF;
    volatile int result = 0;

    /* Analog PLL for Core
     * <SDMEN=0, SSCGBYP=1 => PLL in integer-only mode>
     * Fvco = Fref x (PLLDV[MFI] / PLLDV[RDIV])
     * Fclkout = Fvco / (PLLODIV_n[DIV] + 1)
     * Fvco(PLL) = 480MHz
     * f(pll_ref) = 16d (16Mhz)
     * PLLDV[RDIV] = 1
     * PLLDV[MFI] = 30d (0x1E)
     */

    IP_PLL->PLLODIV[0] &= ~PLL_PLLODIV_DE_MASK;
    IP_PLL->PLLODIV[0] |= PLL_PLLODIV_DE(0);                   /* Disable PHI0 output */
    IP_PLL->PLLODIV[1] &= ~PLL_PLLODIV_DE_MASK;
    IP_PLL->PLLODIV[1] |= PLL_PLLODIV_DE(0);                   /* Disable PHI1 output */

    IP_PLL->PLLCR &= ~PLL_PLLCR_PLLPD_MASK;
    IP_PLL->PLLCR |= PLL_PLLCR_PLLPD(1);                       /* Disable PLL */

    IP_PLL->PLLDV &= ~PLL_PLLDV_ODIV2_MASK;
    IP_PLL->PLLDV |= PLL_PLLDV_ODIV2(0);
    IP_PLL->PLLDV &= ~PLL_PLLDV_RDIV_MASK;
    IP_PLL->PLLDV |= PLL_PLLDV_RDIV(1);                        /* FXOSC = 16MHz / 1 = 16MHz input frequency */
                                                               /* For S32K39x: FXOSC = 40MHz / 1 = 40MHz input frequency */
    IP_PLL->PLLDV &= ~PLL_PLLDV_MFI_MASK;
#if defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    IP_PLL->PLLDV |= PLL_PLLDV_MFI(12);                        /* For S32K39x: FXOSC = 40MHz * 12 = 480MHz VCO frequency */
#else
    IP_PLL->PLLDV |= PLL_PLLDV_MFI(30);                        /* FXOSC = 16MHz * 30 = 480MHz VCO frequency */
#endif
    IP_PLL->PLLFD &= ~PLL_PLLFD_SDMEN_MASK;
    IP_PLL->PLLFD |= PLL_PLLFD_SDMEN(0);                       /* Disable Frac-N mode */
    IP_PLL->PLLFD &= ~PLL_PLLFD_SDM2_MASK;
    IP_PLL->PLLFD |= PLL_PLLFD_SDM2(1);                        /* Enable 2-order SDM */
    IP_PLL->PLLFD &= ~PLL_PLLFD_SDM3_MASK;
    IP_PLL->PLLFD |= PLL_PLLFD_SDM3(1);                        /* Enable 3-order SDM */
    IP_PLL->PLLFD &= ~PLL_PLLFD_MFN_MASK;
    IP_PLL->PLLFD |= PLL_PLLFD_MFN(0);                         /* No fractional divider */

    IP_PLL->PLLFM &= ~PLL_PLLFM_SSCGBYP_MASK;
    IP_PLL->PLLFM |= PLL_PLLFM_SSCGBYP(1);                     /* Bypass modulation */
    IP_PLL->PLLFM &= ~PLL_PLLFM_STEPNO_MASK;
    IP_PLL->PLLFM |= PLL_PLLFM_STEPNO(0);
    IP_PLL->PLLFM &= ~PLL_PLLFM_SPREADCTL_MASK;
    IP_PLL->PLLFM |= PLL_PLLFM_SPREADCTL(1);                   /* Only down-spread modulation supported */
    IP_PLL->PLLFM &= ~PLL_PLLFM_STEPSIZE_MASK;
    IP_PLL->PLLFM |= PLL_PLLFM_STEPSIZE(0);

if ( ((IP_PLL->PLLFM & PLL_PLLFM_SSCGBYP_MASK) >> PLL_PLLFM_SSCGBYP_SHIFT) == 1 ) {
    IP_PLL->PLLCAL2 &= ~PLL_PLLCAL2_ULKCTL_MASK;
    IP_PLL->PLLCAL2 |= PLL_PLLCAL2_ULKCTL(0);                  /* Set lock accuracy to PLLDV[MFI] +/- 9 */
} else {
    IP_PLL->PLLCAL2 &= ~PLL_PLLCAL2_ULKCTL_MASK;
    IP_PLL->PLLCAL2 |= PLL_PLLCAL2_ULKCTL(1);                  /* Set lock accuracy to PLLDV[MFI] +/- 17 */
}

    IP_PLL->PLLODIV[0] &= ~PLL_PLLODIV_DIV_MASK;

    IP_PLL->PLLODIV[0] |= PLL_PLLODIV_DIV(2);                  /* PHI0 = VCO / (ODIV_0 + 1) = 480 / 3 = 160MHz */

    IP_PLL->PLLODIV[1] &= ~PLL_PLLODIV_DIV_MASK;
    IP_PLL->PLLODIV[1] |= PLL_PLLODIV_DIV(1);                  /* PHI1 = VCO / (ODIV_1 + 1) = 480 / 2 = 240MHz */

    IP_PLL->PLLCR &= ~PLL_PLLCR_PLLPD_MASK;
    IP_PLL->PLLCR |= PLL_PLLCR_PLLPD(0);                       /* Enable PLL */

    /* Wait for PLL lock */
    while((((IP_PLL->PLLSR & PLL_PLLSR_LOCK_MASK) >> PLL_PLLSR_LOCK_SHIFT) != 1) && (timeout--)) {}
    if(timeout == 0)
    {
        result = 1;/* PLL_TIMEOUT */
    }
    else
    {

    }

    IP_PLL->PLLODIV[0] &= ~PLL_PLLODIV_DE_MASK;
    IP_PLL->PLLODIV[0] |= PLL_PLLODIV_DE(1);                   /* Enable PHI0 output */
    IP_PLL->PLLODIV[1] &= ~PLL_PLLODIV_DE_MASK;
    IP_PLL->PLLODIV[1] |= PLL_PLLODIV_DE(1);                   /* Enable PHI1 output */

    return result;
}


/*-----------------------------------------------------------------------*/
/* Initialize MC_CGM                                                     */
/*-----------------------------------------------------------------------*/
/* Table 23.4.2 MC_CGM clock source mapping
*       Clock selector index    Clock source
*       0                       FIRC_CLK
*       1                       SIRC_CLK
*       2                       FXOSC_CLK
*       4                       SXOSC_CLK
*       8                       PLL_PHI0_CLK
*       9                       PLL_PHI1_CLK
*       16                      CORE_CLK
*       19                      HSE_CLK
*       22                      AIPS_PLAT_CLK
*       23                      AIPS_SLOW_CLK
*       24                      EMAC_RMII_TX_CLK
*       25                      EMAC_RX_CLK
*/

/* Summary:
*  Option F - Operation in 1:1 mode with CORE_CLK and AXBS_CLK at same speed
*  SysClk_Source            = PLL_PHI0_CLK, CORE_CLK = 80MHz, AIPS_PLAT_CLK = 80MHz, AIPS_SLOW_CLK = 40MHz, HSE_CLK = 80MHz, DCM_CLK = 40MHz, LBIST = 40MHz, QSPI_MEM_CLK = 160MHz
*  STM0_CLK_Source          = AIPS_PLAT_CLK, STM0_CLK = 80MHz
*  STM1_CLK_Source          = AIPS_PLAT_CLK, STM1_CLK = 80MHz
*  STM2_CLK_Source          = AIPS_PLAT_CLK, STM1_CLK = 80MHz
*  FLEXCAN0-2_PE_CLK_Source = AIPS_SLOW_CLK, FLEXCAN0-2_PE_CLK = 40 MHz
*  FLEXCAN3-5_PE_CLK_Source = AIPS_SLOW_CLK, FLEXCAN3-5_PE_CLK = 40 MHz
*  FLEXCAN8-11PE_CLK_Source = AIPS_SLOW_CLK, FLEXCAN8-11_PE_CLK = 40 MHz
*  CLKOUT_STANDBY           = Disabled
*  CLKOUT_RUN               = Disabled
*  EMAC_CLK_RX_Source       = EMAC_MII_RMII_TX_CLK, EMAC_CLK_RX = 50MHz
*  EMAC_CLK_TX_Source       = EMAC_MII_RMII_TX_CLK, EMAC_CLK_TX = 50MHz
*  EMAC_CLK_TS_Source       = EMAC_MII_RMII_TX_CLK, EMAC_CLK_TS = 50MHz
*  QSPI_SFCK_Source         = PLL_PHI1_CLK, QSPI_SFCK = 80MHz
*  TRACE_CLK_Source         = Default value
*/
static int Init_MC_CGM(void)
{
    /* Configure MC_CGM Dividers */
    /* Update dividers alignment policy */
    IP_MC_CGM->MUX_0_DIV_TRIG_CTRL &= ~MC_CGM_MUX_0_DIV_TRIG_CTRL_HHEN_MASK;
    IP_MC_CGM->MUX_0_DIV_TRIG_CTRL |= MC_CGM_MUX_0_DIV_TRIG_CTRL_HHEN(1U);
    IP_MC_CGM->MUX_0_DIV_TRIG_CTRL &= ~MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL_MASK;
    IP_MC_CGM->MUX_0_DIV_TRIG_CTRL |= MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL(1U);

