DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/Platform_TS_T40D34M70I1R0/startup/src/sys_init.c
    /* Option F (Can be changed to Option A by simply setting DC_0_DIV = 0) */
    IP_MC_CGM->MUX_0_DC_0 &= ~MC_CGM_MUX_0_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_0_DC_0 |= MC_CGM_MUX_0_DC_0_DIV(1U);    /* CORE_CLK */
    IP_MC_CGM->MUX_0_DC_1 &= ~MC_CGM_MUX_0_DC_1_DIV_MASK;
    IP_MC_CGM->MUX_0_DC_1 |= MC_CGM_MUX_0_DC_1_DIV(1U);    /* AIPS_PLAT_CLK */
    IP_MC_CGM->MUX_0_DC_2 &= ~MC_CGM_MUX_0_DC_2_DIV_MASK;
    IP_MC_CGM->MUX_0_DC_2 |= MC_CGM_MUX_0_DC_2_DIV(3U);    /* AIPS_SLOW_CLK 40Mhz */
    IP_MC_CGM->MUX_0_DC_3 &= ~MC_CGM_MUX_0_DC_3_DIV_MASK;
    IP_MC_CGM->MUX_0_DC_3 |= MC_CGM_MUX_0_DC_3_DIV(1U);    /* HSE_CLK */
    IP_MC_CGM->MUX_0_DC_4 &= ~MC_CGM_MUX_0_DC_4_DIV_MASK;
    IP_MC_CGM->MUX_0_DC_4 |= MC_CGM_MUX_0_DC_4_DIV(3U);    /* DCM_CLK */
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_0_DC_5 &= ~MC_CGM_MUX_0_DC_5_DIV_MASK;
    IP_MC_CGM->MUX_0_DC_5 |= MC_CGM_MUX_0_DC_5_DIV(3U);    /* LBIST_CLK */
    IP_MC_CGM->MUX_0_DC_6 &= ~MC_CGM_MUX_0_DC_6_DIV_MASK;
    IP_MC_CGM->MUX_0_DC_6 |= MC_CGM_MUX_0_DC_6_DIV(0U);    /* QSPI_MEM_CLK */
#endif
    /* Trigger dividers update */
    IP_MC_CGM->MUX_0_DIV_TRIG = 0xFFFFFFFFU;

    IP_MC_CGM->MUX_1_DC_0  &= ~MC_CGM_MUX_1_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_1_DC_0  |= MC_CGM_MUX_1_DC_0_DIV(0U);    /* STM0_CLK */
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_2_DC_0  &= ~MC_CGM_MUX_2_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_2_DC_0  |= MC_CGM_MUX_2_DC_0_DIV(0U);    /* STM1_CLK */
#endif

#if defined(S32K396) || defined(S32K358) || defined(S32K356) || defined(S32K394) || defined(S32K328) || defined(S32K338) || defined(S32K348) \
    || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366) || defined(S32K388) || defined(S32K389)
    IP_MC_CGM->MUX_13_DC_0  &= ~MC_CGM_MUX_13_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_13_DC_0  |= MC_CGM_MUX_13_DC_0_DIV(0U);    /* STM2_CLK */
#endif
    IP_MC_CGM->MUX_3_DC_0  &= ~MC_CGM_MUX_3_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_3_DC_0  |= MC_CGM_MUX_3_DC_0_DIV(0U);    /* FLEXCAN0-2_PE_CLK */
#if !defined(S32K311) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_4_DC_0  &= ~MC_CGM_MUX_4_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_4_DC_0  |= MC_CGM_MUX_4_DC_0_DIV(0U);    /* FLEXCAN3-5_PE_CLK */
#endif
    IP_MC_CGM->MUX_5_DC_0  &= ~MC_CGM_MUX_5_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_5_DC_0  |= MC_CGM_MUX_5_DC_0_DIV(0U);    /* CLKOUT_STANDBY */
    IP_MC_CGM->MUX_6_DC_0  &= ~MC_CGM_MUX_6_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_6_DC_0  |= MC_CGM_MUX_6_DC_0_DIV(0U);    /* CLKOUT_RUN */
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_7_DC_0  &= ~MC_CGM_MUX_7_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_7_DC_0  |= MC_CGM_MUX_7_DC_0_DIV(1U);    /* EMAC_RX_CLK */
    IP_MC_CGM->MUX_8_DC_0  &= ~MC_CGM_MUX_8_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_8_DC_0  |= MC_CGM_MUX_8_DC_0_DIV(1U);    /* EMAC_TX_CLK */
    IP_MC_CGM->MUX_9_DC_0  &= ~MC_CGM_MUX_9_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_9_DC_0  |= MC_CGM_MUX_9_DC_0_DIV(0U);    /* EMAC_TS_CLK */
    IP_MC_CGM->MUX_10_DC_0 &= ~MC_CGM_MUX_10_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_10_DC_0 |= MC_CGM_MUX_10_DC_0_DIV(2U);   /* QUADSPI_SFCK */
#endif
#ifdef S32K389
    IP_MC_CGM->MUX_20_DC_0  &= ~MC_CGM_MUX_20_DC_0_DIV_MASK;
    IP_MC_CGM->MUX_20_DC_0  |= MC_CGM_MUX_20_DC_0_DIV(0U);    /* FLEXCAN8-11_PE_CLK */
#endif

    /* Wait until divider configuration update has finished */
    while (1U == ((IP_MC_CGM->MUX_0_DIV_UPD_STAT  & MC_CGM_MUX_0_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_0_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
    while (1U == ((IP_MC_CGM->MUX_1_DIV_UPD_STAT  & MC_CGM_MUX_1_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_1_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (1U == ((IP_MC_CGM->MUX_2_DIV_UPD_STAT  & MC_CGM_MUX_2_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_2_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
#endif
    while (1U == ((IP_MC_CGM->MUX_3_DIV_UPD_STAT  & MC_CGM_MUX_3_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_3_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
#if !defined(S32K311) &&  !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (1U == ((IP_MC_CGM->MUX_4_DIV_UPD_STAT  & MC_CGM_MUX_4_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_4_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
#endif
    while (1U == ((IP_MC_CGM->MUX_5_DIV_UPD_STAT  & MC_CGM_MUX_5_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_5_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
    while (1U == ((IP_MC_CGM->MUX_6_DIV_UPD_STAT  & MC_CGM_MUX_6_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_6_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
#if !defined(S32K311) && !defined(S32K312) &&  !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (1U == ((IP_MC_CGM->MUX_7_DIV_UPD_STAT  & MC_CGM_MUX_7_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_7_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
    while (1U == ((IP_MC_CGM->MUX_8_DIV_UPD_STAT  & MC_CGM_MUX_8_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_8_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
    while (1U == ((IP_MC_CGM->MUX_9_DIV_UPD_STAT  & MC_CGM_MUX_9_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_9_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
    while (1U == ((IP_MC_CGM->MUX_10_DIV_UPD_STAT & MC_CGM_MUX_10_DIV_UPD_STAT_DIV_STAT_MASK) >> MC_CGM_MUX_10_DIV_UPD_STAT_DIV_STAT_SHIFT)) {}
#endif
#if defined(S32K396) || defined(S32K358) || defined(S32K356) || defined(S32K394) || defined(S32K328) || defined(S32K338) || defined(S32K348) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    while (1U == ((IP_MC_CGM->MUX_13_DIV_UPD_STAT  & MC_CGM_MUX_13_DIV_UPD_STAT_DIV_STAT_MASK)  >> MC_CGM_MUX_13_DIV_UPD_STAT_DIV_STAT_SHIFT))  {}
#endif

#if 0 /* In S32K3/M27x platform, the DE bit of the MUX_0_DC_y registers in MC_CGM is read‑only and has a default value of “1”. No need to confifure DE bit. */
    /* Switch MC_CGM Dividers */
    IP_MC_CGM->MUX_0_DC_0 &= ~MC_CGM_MUX_0_DC_0_DE_MASK;
    IP_MC_CGM->MUX_0_DC_0 |= MC_CGM_MUX_0_DC_0_DE(1U);     /* CORE_CLK */
    IP_MC_CGM->MUX_0_DC_1 &= ~MC_CGM_MUX_0_DC_1_DE_MASK;
    IP_MC_CGM->MUX_0_DC_1 |= MC_CGM_MUX_0_DC_1_DE(1U);     /* AIPS_PLAT_CLK */
    IP_MC_CGM->MUX_0_DC_2 &= ~MC_CGM_MUX_0_DC_2_DE_MASK;
    IP_MC_CGM->MUX_0_DC_2 |= MC_CGM_MUX_0_DC_2_DE(1U);     /* AIPS_SLOW_CLK */
    IP_MC_CGM->MUX_0_DC_3 &= ~MC_CGM_MUX_0_DC_3_DE_MASK;
    IP_MC_CGM->MUX_0_DC_3 |= MC_CGM_MUX_0_DC_3_DE(1U);     /* HSE_CLK */
    IP_MC_CGM->MUX_0_DC_4 &= ~MC_CGM_MUX_0_DC_4_DE_MASK;
    IP_MC_CGM->MUX_0_DC_4 |= MC_CGM_MUX_0_DC_4_DE(1U);     /* DCM_CLK */
#if !defined(S32K311) && !defined(S32K312) &&  !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_0_DC_5 &= ~MC_CGM_MUX_0_DC_5_DE_MASK;
    IP_MC_CGM->MUX_0_DC_5 |= MC_CGM_MUX_0_DC_5_DE(1U);     /* LBIST_CLK */
    IP_MC_CGM->MUX_0_DC_6 &= ~MC_CGM_MUX_0_DC_6_DE_MASK;
    IP_MC_CGM->MUX_0_DC_6 |= MC_CGM_MUX_0_DC_6_DE(1U);     /* QSPI_MEM_CLK */
#endif
#endif

    IP_MC_CGM->MUX_1_DC_0  &= ~MC_CGM_MUX_1_DC_0_DE_MASK;
    IP_MC_CGM->MUX_1_DC_0  |= MC_CGM_MUX_1_DC_0_DE(1U);    /* STM0_CLK */
#if !defined(S32K311) && !defined(S32K312) &&  !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_2_DC_0  &= ~MC_CGM_MUX_2_DC_0_DE_MASK;
    IP_MC_CGM->MUX_2_DC_0  |= MC_CGM_MUX_2_DC_0_DE(1U);    /* STM1_CLK */
#endif
#if defined(S32K396) || defined(S32K358) || defined(S32K356) || defined(S32K394) || defined(S32K328) || defined(S32K338) || defined(S32K348) \
    || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366) || defined(S32K388) || defined(S32K389)
    IP_MC_CGM->MUX_13_DC_0  &= ~MC_CGM_MUX_13_DC_0_DE_MASK;
    IP_MC_CGM->MUX_13_DC_0  |= MC_CGM_MUX_13_DC_0_DE(1U);    /* STM2_CLK */
#endif
    IP_MC_CGM->MUX_3_DC_0  &= ~MC_CGM_MUX_3_DC_0_DE_MASK;
    IP_MC_CGM->MUX_3_DC_0  |= MC_CGM_MUX_3_DC_0_DE(1U);    /* FLEXCAN0-2_PE_CLK */
#if !defined(S32K311) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_4_DC_0  &= ~MC_CGM_MUX_4_DC_0_DE_MASK;
    IP_MC_CGM->MUX_4_DC_0  |= MC_CGM_MUX_4_DC_0_DE(1U);    /* FLEXCAN3-5_PE_CLK */
#endif
    IP_MC_CGM->MUX_5_DC_0  &= ~MC_CGM_MUX_5_DC_0_DE_MASK;
    IP_MC_CGM->MUX_5_DC_0  |= MC_CGM_MUX_5_DC_0_DE(0U);    /* CLKOUT_STANDBY */
    IP_MC_CGM->MUX_6_DC_0  &= ~MC_CGM_MUX_6_DC_0_DE_MASK;
    IP_MC_CGM->MUX_6_DC_0  |= MC_CGM_MUX_6_DC_0_DE(0U);    /* CLKOUT_RUN */
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_7_DC_0  &= ~MC_CGM_MUX_7_DC_0_DE_MASK;
    IP_MC_CGM->MUX_7_DC_0  |= MC_CGM_MUX_7_DC_0_DE(1U);    /* EMAC_RX_CLK */
    IP_MC_CGM->MUX_8_DC_0  &= ~MC_CGM_MUX_8_DC_0_DE_MASK;
    IP_MC_CGM->MUX_8_DC_0  |= MC_CGM_MUX_8_DC_0_DE(1U);    /* EMAC_TX_CLK */
    IP_MC_CGM->MUX_9_DC_0  &= ~MC_CGM_MUX_9_DC_0_DE_MASK;
    IP_MC_CGM->MUX_9_DC_0  |= MC_CGM_MUX_9_DC_0_DE(1U);    /* EMAC_TS_CLK */
    IP_MC_CGM->MUX_10_DC_0 &= ~MC_CGM_MUX_10_DC_0_DE_MASK;
    IP_MC_CGM->MUX_10_DC_0 |= MC_CGM_MUX_10_DC_0_DE(1U);   /* QUADSPI_SFCK */
#endif
#if defined(S32K388) || defined(S32K389)
    IP_MC_CGM->MUX_18_DC_0  &= ~MC_CGM_MUX_18_DC_0_DE_MASK;
    IP_MC_CGM->MUX_18_DC_0  |= MC_CGM_MUX_18_DC_0_DE(1U);
    IP_MC_CGM->MUX_19_DC_0 &= ~MC_CGM_MUX_19_DC_0_DE_MASK;
    IP_MC_CGM->MUX_19_DC_0 |= MC_CGM_MUX_19_DC_0_DE(1U);
#endif
#ifdef S32K389
    IP_MC_CGM->MUX_20_DC_0  &= ~MC_CGM_MUX_20_DC_0_DE_MASK;
    IP_MC_CGM->MUX_20_DC_0  |= MC_CGM_MUX_20_DC_0_DE(1U);    /* FLEXCAN8-11_PE_CLK */
#endif

