DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/Platform_TS_T40D34M70I1R0/startup/src/sys_init.c
    /* Select MC_CGM sources */
    IP_MC_CGM->MUX_0_CSC  &= ~MC_CGM_MUX_0_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_0_CSC  |= MC_CGM_MUX_0_CSC_SELCTL(8);        /* Select PLL_PHI0_CLK (OUT: SYS_CLK) */
    IP_MC_CGM->MUX_1_CSC  &= ~MC_CGM_MUX_1_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_1_CSC  |= MC_CGM_MUX_1_CSC_SELCTL(22);        /* Select AIPS_PLAT_CLK (OUT: STM0_CLK) */
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_2_CSC  &= ~MC_CGM_MUX_2_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_2_CSC  |= MC_CGM_MUX_2_CSC_SELCTL(22);        /* Select AIPS_PLAT_CLK (OUT: STM1_CLK) */
#endif
#if defined(S32K396) || defined(S32K358) || defined(S32K356) || defined(S32K394) || defined(S32K328) || defined(S32K338) || defined(S32K348) \
    || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366) || defined(S32K388) || defined(S32K389)
    IP_MC_CGM->MUX_13_CSC  &= ~MC_CGM_MUX_13_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_13_CSC  |= MC_CGM_MUX_13_CSC_SELCTL(22);        /* Select AIPS_PLAT_CLK (OUT: STM2_CLK) */
#endif
    IP_MC_CGM->MUX_3_CSC  &= ~MC_CGM_MUX_3_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_3_CSC  |= MC_CGM_MUX_3_CSC_SELCTL(22);        /* Select AIPS_PLAT_CLK (OUT: FLEXCAN0-2_PE_CLK) */
#if !defined(S32K311) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_4_CSC  &= ~MC_CGM_MUX_4_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_4_CSC  |= MC_CGM_MUX_4_CSC_SELCTL(22);        /* Select AIPS_PLAT_CLK (OUT: FLEXCAN3-5_PE_CLK) */
#endif
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_7_CSC  &= ~MC_CGM_MUX_7_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_7_CSC  |= MC_CGM_MUX_7_CSC_SELCTL(24);        /* Select EMAC_MII_RMII_TX_CLK (OUT: EMAC_RX_CLK) */
    IP_MC_CGM->MUX_8_CSC  &= ~MC_CGM_MUX_8_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_8_CSC  |= MC_CGM_MUX_8_CSC_SELCTL(24);        /* Select EMAC_MII_RMII_TX_CLK (OUT: EMAC_TX_CLK) */
    IP_MC_CGM->MUX_9_CSC  &= ~MC_CGM_MUX_9_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_9_CSC  |= MC_CGM_MUX_9_CSC_SELCTL(24);        /* Select EMAC_MII_RMII_TX_CLK (OUT: EMAC_TS_CLK) */
    IP_MC_CGM->MUX_10_CSC &= ~MC_CGM_MUX_10_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_10_CSC |= MC_CGM_MUX_10_CSC_SELCTL(9);        /* Select PLL_PHI1_CLK (OUT: QUADSPI_SFCK) */
#endif
#if defined(S32K388) || defined(S32K389)
    IP_MC_CGM->MUX_18_CSC &= ~MC_CGM_MUX_18_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_18_CSC |= MC_CGM_MUX_18_CSC_SELCTL(0);        /* Select FIRC_CLK */
    IP_MC_CGM->MUX_19_CSC &= ~MC_CGM_MUX_19_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_19_CSC |= MC_CGM_MUX_19_CSC_SELCTL(0);        /* Select FIRC_CLK */
#endif
#ifdef S32K389
    IP_MC_CGM->MUX_20_CSC  &= ~MC_CGM_MUX_20_CSC_SELCTL_MASK;
    IP_MC_CGM->MUX_20_CSC  |= MC_CGM_MUX_20_CSC_SELCTL(22);      /* Select AIPS_PLAT_CLK (OUT: FLEXCAN8-11_PE_CLK) */
#endif
    /* Switch MC_CGM sources */
    IP_MC_CGM->MUX_0_CSC  &= ~MC_CGM_MUX_0_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_0_CSC  |= MC_CGM_MUX_0_CSC_CLK_SW(1) | MC_CGM_MUX_0_CSC_RAMPUP(1) | MC_CGM_MUX_0_CSC_RAMPDOWN(1);
    IP_MC_CGM->MUX_1_CSC  &= ~MC_CGM_MUX_1_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_1_CSC  |= MC_CGM_MUX_1_CSC_CLK_SW(1);
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_2_CSC  &= ~MC_CGM_MUX_2_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_2_CSC  |= MC_CGM_MUX_2_CSC_CLK_SW(1);
#endif
    IP_MC_CGM->MUX_3_CSC  &= ~MC_CGM_MUX_3_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_3_CSC  |= MC_CGM_MUX_3_CSC_CLK_SW(1);
#if !defined(S32K311) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_4_CSC  &= ~MC_CGM_MUX_4_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_4_CSC  |= MC_CGM_MUX_4_CSC_CLK_SW(1);
#endif
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_CGM->MUX_7_CSC  &= ~MC_CGM_MUX_7_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_7_CSC  |= MC_CGM_MUX_7_CSC_CLK_SW(1);
    IP_MC_CGM->MUX_8_CSC  &= ~MC_CGM_MUX_8_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_8_CSC  |= MC_CGM_MUX_8_CSC_CLK_SW(1);
    IP_MC_CGM->MUX_9_CSC  &= ~MC_CGM_MUX_9_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_9_CSC  |= MC_CGM_MUX_9_CSC_CLK_SW(1);
    IP_MC_CGM->MUX_10_CSC &= ~MC_CGM_MUX_10_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_10_CSC |= MC_CGM_MUX_10_CSC_CLK_SW(1);
#endif
#if defined(S32K396) || defined(S32K358) || defined(S32K356) || defined(S32K394) || defined(S32K328) || defined(S32K338) || defined(S32K348) \
    || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    IP_MC_CGM->MUX_13_CSC  &= ~MC_CGM_MUX_13_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_13_CSC  |= MC_CGM_MUX_13_CSC_CLK_SW(1);
#endif
#if defined(S32K388) || defined(S32K389)
    IP_MC_CGM->MUX_18_CSC  &= ~MC_CGM_MUX_18_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_18_CSC  |= MC_CGM_MUX_18_CSC_CLK_SW(1);
    IP_MC_CGM->MUX_19_CSC  &= ~MC_CGM_MUX_19_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_19_CSC  |= MC_CGM_MUX_19_CSC_CLK_SW(1);
#endif
#ifdef S32K389
    IP_MC_CGM->MUX_20_CSC  &= ~MC_CGM_MUX_20_CSC_CLK_SW_MASK;
    IP_MC_CGM->MUX_20_CSC  |= MC_CGM_MUX_20_CSC_CLK_SW(1);
#endif
    /* Wait for configuration bits to auto-clear */
    while (0U == ((IP_MC_CGM->MUX_0_CSS  & MC_CGM_MUX_0_CSS_CLK_SW_MASK)  >> MC_CGM_MUX_0_CSS_CLK_SW_SHIFT))  {}
    while (0U == ((IP_MC_CGM->MUX_1_CSS  & MC_CGM_MUX_1_CSS_CLK_SW_MASK)  >> MC_CGM_MUX_1_CSS_CLK_SW_SHIFT))  {}
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (0U == ((IP_MC_CGM->MUX_2_CSS  & MC_CGM_MUX_2_CSS_CLK_SW_MASK)  >> MC_CGM_MUX_2_CSS_CLK_SW_SHIFT))  {}
#endif
    while (0U == ((IP_MC_CGM->MUX_3_CSS  & MC_CGM_MUX_3_CSS_CLK_SW_MASK)  >> MC_CGM_MUX_3_CSS_CLK_SW_SHIFT))  {}
#if !defined(S32K311) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (0U == ((IP_MC_CGM->MUX_4_CSS  & MC_CGM_MUX_4_CSS_CLK_SW_MASK)  >> MC_CGM_MUX_4_CSS_CLK_SW_SHIFT))  {}
#endif
#if defined(S32K396) || defined(S32K358) || defined(S32K356) || defined(S32K394) || defined(S32K328) || defined(S32K338) || defined(S32K348) \
    || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    while (0U == ((IP_MC_CGM->MUX_13_CSS  & MC_CGM_MUX_13_CSS_CLK_SW_MASK)  >> MC_CGM_MUX_13_CSS_CLK_SW_SHIFT))  {}
#endif
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (0U == ((IP_MC_CGM->MUX_7_CSS  & MC_CGM_MUX_7_CSS_CLK_SW_MASK)  >> MC_CGM_MUX_7_CSS_CLK_SW_SHIFT))  {}
    while (0U == ((IP_MC_CGM->MUX_8_CSS  & MC_CGM_MUX_8_CSS_CLK_SW_MASK)  >> MC_CGM_MUX_8_CSS_CLK_SW_SHIFT))  {}
    while (0U == ((IP_MC_CGM->MUX_9_CSS  & MC_CGM_MUX_9_CSS_CLK_SW_MASK)  >> MC_CGM_MUX_9_CSS_CLK_SW_SHIFT))  {}
    while (0U == ((IP_MC_CGM->MUX_10_CSS & MC_CGM_MUX_10_CSS_CLK_SW_MASK) >> MC_CGM_MUX_10_CSS_CLK_SW_SHIFT)) {}
#endif
    /* Wait for the clock switch to complete */
    while (1U == ((IP_MC_CGM->MUX_0_CSS  & MC_CGM_MUX_0_CSS_SWIP_MASK)  >> MC_CGM_MUX_0_CSS_SWIP_SHIFT))  {}
    while (1U == ((IP_MC_CGM->MUX_1_CSS  & MC_CGM_MUX_1_CSS_SWIP_MASK)  >> MC_CGM_MUX_1_CSS_SWIP_SHIFT))  {}
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (1U == ((IP_MC_CGM->MUX_2_CSS  & MC_CGM_MUX_2_CSS_SWIP_MASK)  >> MC_CGM_MUX_2_CSS_SWIP_SHIFT))  {}
#endif
    while (1U == ((IP_MC_CGM->MUX_3_CSS  & MC_CGM_MUX_3_CSS_SWIP_MASK)  >> MC_CGM_MUX_3_CSS_SWIP_SHIFT))  {}
#if !defined(S32K311) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (1U == ((IP_MC_CGM->MUX_4_CSS  & MC_CGM_MUX_4_CSS_SWIP_MASK)  >> MC_CGM_MUX_4_CSS_SWIP_SHIFT))  {}
#endif

#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (1U == ((IP_MC_CGM->MUX_7_CSS  & MC_CGM_MUX_7_CSS_SWIP_MASK)  >> MC_CGM_MUX_7_CSS_SWIP_SHIFT))  {}
    while (1U == ((IP_MC_CGM->MUX_8_CSS  & MC_CGM_MUX_8_CSS_SWIP_MASK)  >> MC_CGM_MUX_8_CSS_SWIP_SHIFT))  {}
    while (1U == ((IP_MC_CGM->MUX_9_CSS  & MC_CGM_MUX_9_CSS_SWIP_MASK)  >> MC_CGM_MUX_9_CSS_SWIP_SHIFT))  {}
    while (1U == ((IP_MC_CGM->MUX_10_CSS & MC_CGM_MUX_10_CSS_SWIP_MASK) >> MC_CGM_MUX_10_CSS_SWIP_SHIFT)) {}
#endif
#if defined(S32K396) || defined(S32K358) || defined(S32K356) || defined(S32K394) || defined(S32K328) || defined(S32K338) || defined(S32K348) \
    || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    while (1U == ((IP_MC_CGM->MUX_13_CSS  & MC_CGM_MUX_13_CSS_SWIP_MASK)  >> MC_CGM_MUX_13_CSS_SWIP_SHIFT))  {}
#endif
#if defined(S32K388) || defined(S32K389)
    while (1U == ((IP_MC_CGM->MUX_18_CSS  & MC_CGM_MUX_18_CSS_SWIP_MASK)  >> MC_CGM_MUX_18_CSS_SWIP_SHIFT))  {}
    while (1U == ((IP_MC_CGM->MUX_19_CSS  & MC_CGM_MUX_19_CSS_SWIP_MASK)  >> MC_CGM_MUX_19_CSS_SWIP_SHIFT))  {}
#endif
#ifdef S32K389
    while (0U == ((IP_MC_CGM->MUX_20_CSS  & MC_CGM_MUX_20_CSS_CLK_SW_MASK)  >> MC_CGM_MUX_20_CSS_CLK_SW_SHIFT))  {}
#endif

