DsCensored/ProjectTestNXP/S32K344_DEMO/S32K344_DEMO/RTD/Platform_TS_T40D34M70I1R0/startup/src/sys_init.c
    return 0; /*Success*/
}

static int Switch_Core_FIRC(void)
{
    volatile uint32 timeout = 0xFFFF;
    volatile int result = 0;

    /* Verify that we don't have switching in progress */
    while (((IP_MC_CGM->MUX_0_CSS & MC_CGM_MUX_0_CSS_SWIP_MASK) >> MC_CGM_MUX_0_CSS_SWIP_SHIFT) != 0) {}
    /* Safe clock switch request to FIRC_CLK */
    IP_MC_CGM->MUX_0_CSC |= MC_CGM_MUX_0_CSC_SAFE_SW(1) | MC_CGM_MUX_0_CSC_RAMPUP(1) | MC_CGM_MUX_0_CSC_RAMPDOWN(1);

    /* Wait for acknowledge to be cleared */
    while (((IP_MC_CGM->MUX_0_CSS & MC_CGM_MUX_0_CSC_SAFE_SW_MASK) >> MC_CGM_MUX_0_CSC_SAFE_SW_SHIFT) != 1) {}

    /* Verify that clock switch completed */
    while ((((IP_MC_CGM->MUX_0_CSS & MC_CGM_MUX_0_CSS_SWIP_MASK) >> MC_CGM_MUX_0_CSS_SWIP_SHIFT) != 0) && (timeout--)) {}
    if(timeout == 0)
    {
        result = 1;/* MC_CGM_CLK_SWITCH_TIMEOUT */
    }
    else
    {

    }

    return result;
}

/*-----------------------------------------------------------------------*/
/* Initialize MC_ME                                                      */
/*-----------------------------------------------------------------------*/
static int Init_MC_ME(void)
{
/* Enable partitions */
#if !defined(S32K394) && !defined(S32K396) && !defined(S32K374) && !defined(S32K376) && !defined(S32K364) && !defined(S32K366)
    IP_MC_ME->PRTN0_PCONF |= MC_ME_PRTN0_PCONF_PCE_MASK;
#else   /* workaround for K396 : PRTN0_PCONF register is available on hardware. This workaround will be updated after confirm with header team */
    *((volatile uint32 *)(0x402DC100)) |= MC_ME_PRTN0_PCONF_PCE_MASK;
#endif
    IP_MC_ME->PRTN1_PCONF |= MC_ME_PRTN1_PCONF_PCE_MASK;
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_ME->PRTN2_PCONF |= MC_ME_PRTN2_PCONF_PCE_MASK;
#endif
#if defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    IP_MC_ME->PRTN3_PCONF |= MC_ME_PRTN3_PCONF_PCE_MASK;
#endif
    /* Prepare partition update */
#if !defined(S32K394) && !defined(S32K396) && !defined(S32K374) && !defined(S32K376) && !defined(S32K364) && !defined(S32K366)
    IP_MC_ME->PRTN0_PUPD  |= MC_ME_PRTN0_PUPD_PCUD_MASK;
#else   /* workaround for K396 : PRTN0_PUPD register is available on hardware. This workaround will be updated after confirm with header team */
    *((volatile uint32 *)(0x402DC104)) |= MC_ME_PRTN0_PUPD_PCUD_MASK;
#endif
    IP_MC_ME->PRTN1_PUPD  |= MC_ME_PRTN1_PUPD_PCUD_MASK;
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_ME->PRTN2_PUPD  |= MC_ME_PRTN2_PUPD_PCUD_MASK;
#endif
#if defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    IP_MC_ME->PRTN3_PUPD  |= MC_ME_PRTN3_PUPD_PCUD_MASK;
#endif
    /* Trigger partition update by writing CTL_KEYs */
    IP_MC_ME->CTL_KEY = 0x5AF0;
    IP_MC_ME->CTL_KEY = 0xA50F;

    /* Poll partition update statuses */
#if !defined(S32K394) && !defined(S32K396) && !defined(S32K374) && !defined(S32K376) && !defined(S32K364) && !defined(S32K366)
    while (((IP_MC_ME->PRTN0_PUPD & MC_ME_PRTN0_PUPD_PCUD_MASK) >> MC_ME_PRTN0_PUPD_PCUD_SHIFT) != 0) {}
#else   /* workaround for K396 : PRTN0_PUPD register is available on hardware. This workaround will be updated after confirm with header team */
    while (((*((volatile uint32 *)(0x402DC104)) & MC_ME_PRTN0_PUPD_PCUD_MASK) >> MC_ME_PRTN0_PUPD_PCUD_SHIFT) != 0) {}
#endif
    while (((IP_MC_ME->PRTN1_PUPD & MC_ME_PRTN1_PUPD_PCUD_MASK) >> MC_ME_PRTN1_PUPD_PCUD_SHIFT) != 0) {}
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (((IP_MC_ME->PRTN2_PUPD & MC_ME_PRTN2_PUPD_PCUD_MASK) >> MC_ME_PRTN2_PUPD_PCUD_SHIFT) != 0) {}
#endif
#if defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    while (((IP_MC_ME->PRTN3_PUPD & MC_ME_PRTN3_PUPD_PCUD_MASK) >> MC_ME_PRTN3_PUPD_PCUD_SHIFT) != 0) {}
#endif
    /* Check partition clocks' statuses */
    while (((IP_MC_ME->PRTN0_PCONF & MC_ME_PRTN0_PCONF_PCE_MASK) >> MC_ME_PRTN0_PCONF_PCE_SHIFT) != 1) {}
    while (((IP_MC_ME->PRTN1_PCONF & MC_ME_PRTN1_PCONF_PCE_MASK) >> MC_ME_PRTN1_PCONF_PCE_SHIFT) != 1) {}
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (((IP_MC_ME->PRTN2_PCONF & MC_ME_PRTN2_PCONF_PCE_MASK) >> MC_ME_PRTN2_PCONF_PCE_SHIFT) != 1) {}
#endif
#if defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    while (((IP_MC_ME->PRTN3_PCONF & MC_ME_PRTN3_PCONF_PCE_MASK) >> MC_ME_PRTN3_PCONF_PCE_SHIFT) != 1) {}
#endif

    /* Enable peripheral clocks */
#if defined(S32K358) || defined(S32K356) || defined(S32K328) || defined(S32K338) || defined(S32K348) || defined(S32K388) || defined(S32K389)
    IP_MC_ME->PRTN0_COFB0_CLKEN |= PRTN0_COFB0_CLKEN_REQ_MASK_U32;
#endif

/* workaround for K396 : PRTN0_COFB1_CLKEN register is available on hardware. This workaround will be updated after confirm with header team */
#if defined(S32K394) || defined(S32K396) || defined(S32K374) || defined(S32K376) || defined(S32K364) || defined(S32K366)
    *((volatile uint32 *)(0x402DC130)) |= PRTN0_COFB0_CLKEN_REQ_MASK_U32;
#endif
#if !defined(S32K394) && !defined(S32K396) && !defined(S32K374) && !defined(S32K376) && !defined(S32K364) && !defined(S32K366)
    IP_MC_ME->PRTN0_COFB1_CLKEN |= PRTN0_COFB1_CLKEN_REQ_MASK_U32;
#else   /* workaround for K396 : PRTN0_COFB1_CLKEN register is available on hardware. This workaround will be updated after confirm with header team */
    *((volatile uint32 *)(0x402DC134)) |= PRTN0_COFB1_CLKEN_REQ_MASK_U32;
#endif

    IP_MC_ME->PRTN1_COFB0_CLKEN |= PRTN1_COFB0_CLKEN_REQ_MASK_U32;
    IP_MC_ME->PRTN1_COFB1_CLKEN |= PRTN1_COFB1_CLKEN_REQ_MASK_U32;
    IP_MC_ME->PRTN1_COFB2_CLKEN |= PRTN1_COFB2_CLKEN_REQ_MASK_U32;
    IP_MC_ME->PRTN1_COFB3_CLKEN |= PRTN1_COFB3_CLKEN_REQ_MASK_U32;
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_ME->PRTN2_COFB0_CLKEN |= PRTN2_COFB0_CLKEN_REQ_MASK_U32;
    IP_MC_ME->PRTN2_COFB1_CLKEN |= PRTN2_COFB1_CLKEN_REQ_MASK_U32;
#endif
#if defined(S32K396) || defined(S32K394) || defined(S32K358) || defined(S32K356) || defined(S32K328) || defined(S32K338) || defined(S32K348) || defined(S32K388) || defined(S32K389) \
    || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    IP_MC_ME->PRTN2_COFB2_CLKEN |= PRTN2_COFB2_CLKEN_REQ_MASK_U32;
#endif
#if defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    IP_MC_ME->PRTN3_COFB0_CLKEN |= PRTN3_COFB0_CLKEN_REQ_MASK_U32;
    IP_MC_ME->PRTN3_COFB1_CLKEN |= PRTN3_COFB1_CLKEN_REQ_MASK_U32;
    IP_MC_ME->PRTN3_COFB2_CLKEN |= PRTN3_COFB2_CLKEN_REQ_MASK_U32;
#endif

    /* Prepare partition update */
#if !defined(S32K394) && !defined(S32K396) && !defined(S32K376) && !defined(S32K374) && !defined(S32K364) && !defined(S32K366)
    IP_MC_ME->PRTN0_PUPD |= MC_ME_PRTN0_PUPD_PCUD_MASK;
#else   /* workaround for K396 : PRTN0_PUPD register is available on hardware. This workaround will be updated after confirm with header team */
    *((volatile uint32 *)(0x402DC104)) |= MC_ME_PRTN0_PUPD_PCUD_MASK;
#endif
    IP_MC_ME->PRTN1_PUPD |= MC_ME_PRTN1_PUPD_PCUD_MASK;
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    IP_MC_ME->PRTN2_PUPD |= MC_ME_PRTN2_PUPD_PCUD_MASK;
#endif
#if defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    IP_MC_ME->PRTN3_PUPD |= MC_ME_PRTN3_PUPD_PCUD_MASK;
#endif
    /* Trigger partition update by writing CTL_KEYs */
    IP_MC_ME->CTL_KEY = 0x5AF0;
    IP_MC_ME->CTL_KEY = 0xA50F;

#ifndef SIM_TYPE_VDK
    /* Poll partition update statuses */
#if !defined(S32K394) && !defined(S32K396) && !defined(S32K374) && !defined(S32K376) && !defined(S32K364) && !defined(S32K366)
    while (((IP_MC_ME->PRTN0_PUPD & MC_ME_PRTN0_PUPD_PCUD_MASK) >> MC_ME_PRTN0_PUPD_PCUD_SHIFT) != 0) {}
#else   /* workaround for K396 : PRTN0_PUPD register is available on hardware. This workaround will be updated after confirm with header team */
    while (((*((volatile uint32 *)(0x402DC104)) & MC_ME_PRTN0_PUPD_PCUD_MASK) >> MC_ME_PRTN0_PUPD_PCUD_SHIFT) != 0) {}
#endif
    while (((IP_MC_ME->PRTN1_PUPD & MC_ME_PRTN1_PUPD_PCUD_MASK) >> MC_ME_PRTN1_PUPD_PCUD_SHIFT) != 0) {}
#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while (((IP_MC_ME->PRTN2_PUPD & MC_ME_PRTN2_PUPD_PCUD_MASK) >> MC_ME_PRTN2_PUPD_PCUD_SHIFT) != 0) {}
#endif

#if defined(S32K358) || defined(S32K356) || defined(S32K328) || defined(S32K338) || defined(S32K348) || defined(S32K388) || defined(S32K389)
    while ((IP_MC_ME->PRTN0_COFB0_STAT & PRTN0_COFB0_CLKEN_REQ_MASK_U32) != PRTN0_COFB0_CLKEN_REQ_MASK_U32) {}
#endif
/* workaround for K396 : PRTN0_COFB1_CLKEN register is available on hardware. This workaround will be updated after confirm with header team */
#if defined(S32K394) || defined(S32K396) || defined(S32K374) || defined(S32K376) || defined(S32K364) || defined(S32K366)
    while ((*((volatile uint32 *)(0x402DC110)) & PRTN0_COFB0_CLKEN_REQ_MASK_U32) != PRTN0_COFB0_CLKEN_REQ_MASK_U32) {}
#endif

#if !defined(S32K394) && !defined(S32K396) && !defined(S32K374) && !defined(S32K376) && !defined(S32K364) && !defined(S32K366)
    while ((IP_MC_ME->PRTN0_COFB1_STAT & PRTN0_COFB1_CLKEN_REQ_MASK_U32) != PRTN0_COFB1_CLKEN_REQ_MASK_U32) {}
#else   /* workaround for K396 : PRTN0_COFB1_STAT register is available on hardware. This workaround will be updated after confirm with header team */
    while ((*((volatile uint32 *)(0x402DC114)) & PRTN0_COFB1_CLKEN_REQ_MASK_U32) != PRTN0_COFB1_CLKEN_REQ_MASK_U32) {}
#endif
    /* Check peripheral clocks statuses */
    while ((IP_MC_ME->PRTN1_COFB0_STAT & PRTN1_COFB0_CLKEN_REQ_MASK_U32) != PRTN1_COFB0_CLKEN_REQ_MASK_U32) {}
    while ((IP_MC_ME->PRTN1_COFB1_STAT & PRTN1_COFB1_CLKEN_REQ_MASK_U32) != PRTN1_COFB1_CLKEN_REQ_MASK_U32) {}
    while ((IP_MC_ME->PRTN1_COFB2_STAT & PRTN1_COFB2_CLKEN_REQ_MASK_U32) != PRTN1_COFB2_CLKEN_REQ_MASK_U32) {}
    while ((IP_MC_ME->PRTN1_COFB3_STAT & PRTN1_COFB3_CLKEN_REQ_MASK_U32) != PRTN1_COFB3_CLKEN_REQ_MASK_U32) {}

#if !defined(S32K311) && !defined(S32K312) && !defined(S32M276) && !defined(S32K310) && !defined(S32M274)
    while ((IP_MC_ME->PRTN2_COFB0_STAT & PRTN2_COFB0_CLKEN_REQ_MASK_U32) != PRTN2_COFB0_CLKEN_REQ_MASK_U32) {}
    while ((IP_MC_ME->PRTN2_COFB1_STAT & PRTN2_COFB1_CLKEN_REQ_MASK_U32) != PRTN2_COFB1_CLKEN_REQ_MASK_U32) {}
#endif
#if defined(S32K388) || defined(S32K389)
    while ((IP_MC_ME->PRTN2_COFB2_STAT & PRTN2_COFB2_CLKEN_REQ_MASK_U32) != PRTN2_COFB2_CLKEN_REQ_MASK_U32) {}
#endif

#if defined(S32K396) || defined(S32K394) || defined(S32K376) || defined(S32K374) || defined(S32K364) || defined(S32K366)
    while ((IP_MC_ME->PRTN3_COFB0_STAT & PRTN3_COFB0_CLKEN_REQ_MASK_U32) != PRTN3_COFB0_CLKEN_REQ_MASK_U32) {}
    while ((IP_MC_ME->PRTN3_COFB1_STAT & PRTN3_COFB1_CLKEN_REQ_MASK_U32) != PRTN3_COFB1_CLKEN_REQ_MASK_U32) {}
    while ((IP_MC_ME->PRTN3_COFB2_STAT & PRTN3_COFB2_CLKEN_REQ_MASK_U32) != PRTN3_COFB2_CLKEN_REQ_MASK_U32) {}
#endif
#endif
    return 0;
}

/**
* @brief sys_init
* @details function used to initiatialize clocks
* @return E_NOT_OK/E_OK
*/
/*================================================================================================*/
Std_ReturnType sys_init(void)
{
    volatile uint32 status = 0UL;

    status += Init_MC_ME();

    status += Init_FIRC();

    status += Switch_Core_FIRC();

    status += Init_FXOSC();

    status += Init_PLL();

    /* Update code to other module can run the test without stuck runtime. Because having issue about Init_PMC() */
    status += Init_PMC();

    status += Init_MC_CGM();

    return E_OK;
}

/*================================================================================================*/
/**
* @brief sys_halt
* @details function used to enter halt mode
*/
/*================================================================================================*/
void sys_halt(void)
{

    EXECUTE_WAIT();
}

/*================================================================================================*/
/**
* @brief sys_stop
* @details function used to enter stop mode
*/
/*================================================================================================*/
void sys_stop(void)
{
    EXECUTE_WAIT();
}

uint8 EUnit_GetCoreID(void)
{
    return OsIf_GetCoreID();
}


#define PLATFORM_STOP_SEC_CODE
#include "Platform_MemMap.h"

#ifdef __cplusplus
}
#endif
